package ____자바정리9_이차배열;

import java.util.Arrays;
/*
	[문제] 방향을 입력받고 입력받은 방향으로 한칸씩민다 밀린숫자는 뒤로붙는다.
		 방향은 북 , 동 , 남 , 서 이다.
		
	[예] 
		[1] "북" ==> 위로 한칸씩 이동하고 맨윗줄은 맨아래로 이동한다.	
			 		
			{ 2, 5, 1, 3, 5 }, 
			{ 1, 2, 1, 3, 9 } 
			{ 3, 1, 2, 5, 6 },
			
		[2] "동" ==> 오른족으로 한칸씩 가고 맨오른족줄은 맨왼쪽으로 이동한다.
		
			{6, 3, 1, 2, 5, },
			{5, 2, 5, 1, 3, }, 
			{9, 1, 2, 1, 3, } 
*/


public class 이차원배열3_문제04_한칸씩밀기 {
	
	public static void main(String[] args) {
		int arr[][] = {

				{ 3, 1, 2, 5, 6 },
				{ 2, 5, 1, 3, 5 }, 
				{ 1, 2, 1, 3, 9 } 
		};
		
		String dir = "";
		
	
	}
}
