package ____자바정리9_이차배열;

public class 이차원배열3_문제10_숫자검색 {
	
	public static void main(String[] args) {
		int [][] arr = {
				{1001, 100, 20, 32},
				{1002, 40, 43, 12},
				{1003, 60, 21, 42},
				{1004, 76, 54, 55},
				{1005, 23, 11, 76},
		};
		
		//[문제1] 모든 점수의 총합 출력 
		
		//[문제2] 국어1등 번호 출력
		
		//[문제3] 수학1등 번호 출력
		
		//[문제4] 영어1등 번호 출력 
		
		//[문제5] 전체1등 번호 출력 
		
		//[문제6] 수학점수가 국어 점수 보다 높은 번호 출력 
		
		//[문제6] 각점수의 총합을 아래 배열에 저장후 출력 
		int total[] = new int[5];
		
		//[문제7] 총점수가 높은순서대로 번호들을 출력 
	}
}