package ____자바정리2_변수;

public class 변수0_문제01_추가 {
	public static void main(String[] args) {
		/*
		 * 시간 테스트 
		 * 
		 * 4000 초를 시간만 출력하시오.
		 * 4000 초를 시간을 제외하고 초만 출력하시오.
		 * 4000 초를 시간을 제외하고 분만 출력하시오.
		 * 
		 * 8000 초를 시간만 출력하시오.
		 * 8000 초를 시간을 제외하고 초만 출력하시오.
		 * 8000 초를 시간을 제외하고 분만 출력하시오.
		 * 
		 * 
		 * 123123 초를 시간만 출력하시오.
		 * 123123 초를 시간을 제외하고 초만 출력하시오.
		 * 123123 초를 시간을 제외하고 분만 출력하시오.
		 */
//		System.out.println(4000/3600);
//		System.out.println(4000%3600/60);
//		System.out.println(4000%60);
//		
//		System.out.println(8000/3600);
//		System.out.println(8000%3600/60);
//		System.out.println(8000%60);
//		
//		System.out.println(123123/3600);
//		System.out.println(123123%60);
//		System.out.println(123123%3600/60);
		
		/*
			34565 의 숫자중에서 제일 가운데 숫자만 변수a 에 담아서 출력하시오.
		
		 */
		
//		int a = 34565%1000/100;
//		System.out.println(a);
	
		/*
		확률 문제			
			[1] 철수는 123초에 팔굽혀펴기를 40개 한다. 		
				팔굽혀 펴기 한개는 몇초 걸렸는지 구하시오. 소수점 2자리까지구하시오.
			123 : 40 = x : 1
			
			[2] 철수는 123초에 팔굽혀펴기를 40개 한다.
				철수는 1초에 팔굽혀펴기를 몇개인지 구하시오. 소수점 2자리까지구하시오.
			123 : 40 = 1 : x	
			
			[3]공이 40개 있다. 공40개를 100퍼센트라고핬을때,
				[3-1] 공한개는 몇퍼센트인가?				
				[3-2] 1퍼센트는 공이 몇개인가?	
				
				[3-1] 40 : 100 = 1 : x
				[3-2] 40 : 100 = x : 1	
				
			[4]책이 총 78page 이다. 
				[4-1] 철수는 책을 64page 읽었다. 몇퍼센트읽은것인가?			
				[4-2] 철수는 책을 30퍼센트 읽었다. 현재 페이지는 몇인가?
				
				[4-1] 64/78*100
				[4-2] x = 78 * 0.7	
		 */
		
		/*
		거리문제		
		[1] 철수는 자전거를 타고 2시간에 65040 미터를 간다. 
			1시간에는 몇미터를 가는가?
			30분에는 몇미터를 가는가?
			10분에는 몇미터를 가는가?
			1분에는 몇미터를 가는가?
			1초에는 몇미터를 가는가?
			17초에는 몇미터를 가는가?
			
		[2]
			철수는 자전거를 타고 2시간에 65040 미터를 간다. 
			
			철수는 10000미터를 몇초에 가는가?
			철수는 1000 미터를 몇초에 가는가?
			철수는 1미터를 몇초에 가는가?
			
		[3] 철수는 시속 3km 의 속도로 37분간 걸어갔다. 
			    철수가 간거리는 몇km 인가?
			    철수가 간거리는 몇m 인가?
			    
		[4] 철수는 870미터를 40분간 걸어갔다. 
				철수의 시속은 얼마인가?
				철수의 분속은 얼마인가?
	 */
	}
}
